{
  "backend/main.mo": "Main Motoko actor implementing user profiles, winning entries, winner claims with payout methods, testimonials, and admin authorization using blob storage and access control mixins.",
  "feature_evidence.json": "Feature evidence report documenting the custom domain mapping configuration interface feature with high confidence, listing relevant frontend files and components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend source files including pages, components, hooks, and styling for the Meta Lottery Portal winner and admin interfaces.",
  "frontend/index.css": "Global Tailwind CSS with OKLCH color system using Facebook blue theme (hue 210-225), custom meta utilities for gradients, glows, pulse animations, and background pattern with overlay.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for the prize-winner claim portal React application.",
  "frontend/src/App.tsx": "TanStack Router setup with protected routes for winner portal pages and admin dashboard including custom domain configuration, with authentication and admin role checks.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Error screen component displaying shield alert icon and customizable access denied message with return home button.",
  "frontend/src/components/AppLayout.tsx": "Main layout wrapper with fixed meta background pattern, navigation bar, main content area, and footer with Meta Lottery Portal branding and caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button with loading states, sign in/out toggle, and query cache clearing on logout.",
  "frontend/src/components/MetaBrandBadge.tsx": "Decorative Meta Verified badge component with gradient background, sparkles icon, and hover animation effects.",
  "frontend/src/components/NavBar.tsx": "Navigation bar component with responsive desktop/mobile menus, authentication-aware navigation links (verify, claim, status, testimonials), and conditional admin/custom-domain links for admin users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name (required) and optionally email/phone, blocking dismissal until profile is saved via useSaveCallerUserProfile hook.",
  "frontend/src/components/winner/CameraCapture.tsx": "Camera capture component using useCamera hook that provides video preview, photo capture, camera switching, and error handling with permission/support detection.",
  "frontend/src/components/winner/ImagePicker.tsx": "File input component for selecting and previewing images with 10MB size limit validation, image type checking, and remove functionality.",
  "frontend/src/components/winner/PayoutMethodFields.tsx": "Dynamic form fields component that renders different input sets (account details, payee info, or card info) based on selected payout method type (bankTransfer, certifiedCheck, or atmCard).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdminClaims.ts": "Mutation hooks for admin operations: updating claim status and adding admin responses to claims, both invalidating the claims query cache on success.",
  "frontend/src/hooks/useAuthz.ts": "Authorization hooks for fetching/saving user profiles, checking admin status, and retrieving user roles, all dependent on the actor being available.",
  "frontend/src/hooks/useClaims.ts": "Hooks for claim operations: submitting winner claims (mutation) and fetching all claims with optional status filtering and pagination (query).",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useTestimonials.ts": "Exports React Query hooks for fetching, adding, and removing testimonials from the backend actor with automatic cache invalidation.",
  "frontend/src/hooks/useWinningEntry.ts": "Provides React Query hooks for managing winning entries including fetching all entries, querying by prize number, and claiming entries with cache updates.",
  "frontend/src/index.css": "Imports the root index.css stylesheet from the parent directory.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard landing page displaying navigation cards for managing prize claims, testimonials, and custom domain setup.",
  "frontend/src/pages/admin/ClaimDetailPage.tsx": "Detailed view for individual prize claims allowing admins to update claim status, send responses, and view claimant information and payout details.",
  "frontend/src/pages/admin/ClaimsListPage.tsx": "Lists all prize claims in a table with status filtering and navigation to individual claim detail pages.",
  "frontend/src/pages/admin/CustomDomainPage.tsx": "Informational page displaying canister ID and current URL with instructions for setting up a custom domain via DNS configuration.",
  "frontend/src/pages/admin/TestimonialsAdminPage.tsx": "Admin page for managing testimonials with a form to add new testimonials (name, title, quote, income, image URL) and a list to view/remove existing testimonials using custom hooks and UI components.",
  "frontend/src/pages/winner/ClaimFormPage.tsx": "Form page for winners to submit prize claims by entering winner ID and selecting a payout method (ATM card, certified check, or bank transfer) with corresponding detail fields, then submitting to the backend.",
  "frontend/src/pages/winner/ClaimStatusPage.tsx": "Displays a list of prize claims submitted by the authenticated user, showing claim ID, winner ID, payout method, submission date, status badges (pending/approved/rejected/awaiting info), and admin responses.",
  "frontend/src/pages/winner/ConfirmationLegitimacyPage.tsx": "Confirmation page shown after claim submission with success message and important safety disclaimers about legitimacy, warning users about scams, upfront fees, and emphasizing no government endorsement.",
  "frontend/src/pages/winner/IdentityVerificationPage.tsx": "Identity verification page allowing users to upload or capture a selfie and ID card photo for verification purposes, with camera capture and file upload options.",
  "frontend/src/pages/winner/TestimonialsPage.tsx": "Public-facing page displaying winner testimonials with avatar, name, title, prize amount, and quote in a card grid layout, including a disclaimer that testimonials are user-submitted and unverified.",
  "frontend/src/pages/winner/VerifyActivatePage.tsx": "Winner portal page for verifying prize and ticket numbers, displaying verification status (valid/invalid/claimed), and allowing users to activate unclaimed prizes via form submission.",
  "frontend/src/pages/winner/WinnerPortalHomePage.tsx": "Landing page for the winner portal featuring a hero banner, Meta branding elements, and action cards linking to verify prize, claim prize, and other winner-facing flows.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both standard query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using OKLCH), container settings, border radius variables, custom shadows, and keyframe animations including Meta-themed pulse effects.",
  "project_state.json": "Project state document tracking implemented features (Internet Identity auth, winner portal flows, claim submission, identity verification, admin dashboard) and noting a branding shift to Facebook-style blue theme with Meta logo motifs."
}