{
  "backend/main.mo": "Motoko canister managing user profiles, winning entries, winner claims, testimonials, and authorization using mixins and maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing concise summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base/style definitions with OKLCH color tokens for the portal theme.",
  "frontend/index.html": "HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration with protected routes for winner and admin flows.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen displaying permission errors with navigation back to home.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing navbar, content container, and footer.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling authentication and query cache reset.",
  "frontend/src/components/NavBar.tsx": "Responsive navigation bar showing authenticated routes, admin link, and login button with mobile menu handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for collecting and saving a user's profile information with validation and error display.",
  "frontend/src/components/winner/CameraCapture.tsx": "Camera capture component providing live preview, photo capture, camera switching, and error handling.",
  "frontend/src/components/winner/ImagePicker.tsx": "Image upload component with file validation, preview display, and removal support.",
  "frontend/src/components/winner/PayoutMethodFields.tsx": "Form fields that change based on selected payout method, updating structured payout data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates queries when identity changes.",
  "frontend/src/hooks/useAdminClaims.ts": "Mutations for admins to update claim status or leave responses, invalidating claim queries on success.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and updating user profiles, checking admin status, and retrieving the caller's role.",
  "frontend/src/hooks/useClaims.ts": "Hooks to submit new winner claims and fetch paginated claims with optional status filtering.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity auth, handling login, stored identities, and status flags.",
  "frontend/src/hooks/useTestimonials.ts": "Offers React Query hooks to fetch, add, and remove testimonials through the backend actor.",
  "frontend/src/hooks/useWinningEntry.ts": "Defines hooks to retrieve winning entries, look up entries by number, and claim winnings via actor mutations.",
  "frontend/src/index.css": "Re-exports the root index.css from one directory up.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with navigation cards for claims and testimonials management.",
  "frontend/src/pages/admin/ClaimDetailPage.tsx": "Displays details for a specific claim and allows admins to update status and send responses.",
  "frontend/src/pages/admin/ClaimsListPage.tsx": "Lists claims with optional filtering and navigation to individual claim detail pages.",
  "frontend/src/pages/admin/TestimonialsAdminPage.tsx": "Allows admins to add and remove testimonials, showing a form and a list of existing items.",
  "frontend/src/pages/winner/ClaimFormPage.tsx": "Form page where winners enter their winner ID, select a payout method, and submit a claim using Internet Identity.",
  "frontend/src/pages/winner/ClaimStatusPage.tsx": "Displays the current user's submitted claims with status badges, payout info, timestamps, and any admin responses.",
  "frontend/src/pages/winner/ConfirmationLegitimacyPage.tsx": "Shows a successful claim submission message and explains legitimacy, safety, and disclaimers about the prize process.",
  "frontend/src/pages/winner/IdentityVerificationPage.tsx": "Allows users to upload or capture a selfie and ID card photo, simulating secure identity document upload.",
  "frontend/src/pages/winner/TestimonialsPage.tsx": "Fetches and displays user-submitted testimonials with images, names, titles, and quotes along with a disclaimer.",
  "frontend/src/pages/winner/VerifyActivatePage.tsx": "Lets users verify a prize by entering numbers, shows validity or claimed state, and allows activation of valid entries.",
  "frontend/src/pages/winner/WinnerPortalHomePage.tsx": "Renders the winner portal home with a banner, claim process info, and cards linking to verification, claim submission, ID upload, and status pages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Defines the Tailwind theme, custom colors, animations, and plugin configuration for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, requirements, known issues, required images, and implemented features for the prize-claim portal."
}