{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add custom domain/URL configuration for the live Meta Lottery Portal",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Add a configuration interface or documentation to enable custom domain mapping for the deployed canister URL, allowing the user to configure a vanity URL or custom domain for the Meta Lottery Portal",
      "acceptanceCriteria": [
        "User can configure a custom domain or vanity URL for the canister",
        "Instructions or UI elements guide the user through domain configuration steps",
        "The custom URL mapping works without breaking Internet Identity authentication",
        "Documentation includes any necessary DNS or canister configuration steps"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/CustomDomainPage.tsx",
          "operation": "create",
          "description": "Create a new admin page that provides step-by-step documentation and guidance for configuring a custom domain or vanity URL. Display the current canister ID (https://iwwkn-jyaaa-aaaap-qnc6q-cai.icp0.io) and include sections for: (1) DNS configuration steps with CNAME record examples, (2) Internet Computer boundary node custom domain setup instructions, (3) Internet Identity authentication considerations including authorized origins configuration, (4) Testing and verification steps. Use the authorization component to restrict access to admin users only via AccessControl.hasPermission with #admin role. Include copy-to-clipboard functionality for technical values like the canister ID. Style consistently with existing admin pages using Tailwind and shadcn/ui components."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new protected route for /admin/custom-domain that renders the CustomDomainPage component. Place this route within the existing admin routes section alongside ClaimsListPage, ClaimDetailPage, TestimonialsAdminPage, and AdminDashboardPage. Ensure the route is protected by the same RequireAuth wrapper with requireAdmin prop set to true."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a navigation card or link to the new Custom Domain configuration page. Include an appropriate icon (e.g., Globe or Link icon from lucide-react) and descriptive text such as 'Custom Domain Setup' with a subtitle like 'Configure your vanity URL'. Place this alongside existing navigation options for Claims and Testimonials management."
        },
        {
          "path": "frontend/src/components/NavBar.tsx",
          "operation": "modify",
          "description": "Add a navigation link to the Custom Domain page in both the desktop and mobile admin menu sections. Label it 'Custom Domain' and link to /admin/custom-domain. Ensure it only appears when the user is authenticated and has admin privileges, following the same pattern as existing admin-only navigation items."
        }
      ]
    }
  ]
}